[
  {
    "title": "Customer focused local council website",
    "employer": "Liverpool City Council",
    "date": "Summer 2011",
    "content": "I worked for Liverpool City Council for 15 years as an integral part of their Digital Services team overseeing 5 design iterations of liverpool.gov.uk. In 2011 we performed a customer focused “Top Tasks” optimisation of the site which served as the template for a new generation of transactional council websites.",
    "img": "lcc-1.png"
  },
  {
    "title": "Identity provider for UK govt",
    "employer": "Experian",
    "date": "2016-17",
    "content": "Working with the UK government digital service (GDS) on class-leading software as a service to enable UK citizens to register for vital services such as universal credit. I am responsible for all UX strategy and product design as well as ongoing conversion uplift and new opportunity generation.",
    "img": "idaas-pixellated.png"
  },
  {
    "title": "Game-changing flexible insurance app",
    "employer": "DayInsure",
    "date": "2017-18",
    "content": "Dayinsure want to change the way people buy insurance. My role was to come up with an app which allowed a person to buy insurance for anything, anywhere, anytime. Working hand-in-hand with a their product designer we came up with a concept which was demonstrated to Dayinsure’s industry leading underwriting partner causing great excitement",
    "img": "flexinsure-web.png"
  },
  {
    "title": "Digital engagement strategy",
    "employer": "Liverpool City Council",
    "date": "2016",
    "content": "I worked closely with local government digital colleagues nationwide through the LocalGovDigital working group on the first draft of Liverpool City Council's Digital transformation Strategy.",
    "img": "digital-strategy-mindmapengagement.png"
  },
  {
    "title": "Electronic library for Liverpool",
    "employer": "Liverpool City Council",
    "date": "2012",
    "content": "ReadLiverpool is a full-featured electronic library for the citizens of Liverpool. I acted as Product Owner, Lead Designer and developed the site from photos to sketch, to mockup, to functional HTML/CSS/Javascript prototype. Working closely with library staff, the site was extensively usability tested across the full demographic range of Liverpool citizens so as to be as easy to use as possible.",
    "img": "library.png"
  },
  {
    "title": "'Pipeline' - Resource management application in angular.js",
    "employer": "Liverpool City Council",
    "date": "2013",
    "content": "Looking to learn angular.js in my spare time I took it upon myself to build a useful project as a sideline. Back ended on the trello API, Pipeline manages team resources to agile projects, showing gantt chart views of project timelines, resources and team leave.",
    "img": "pipeline.jpg"
  },
  {
    "title": "Digital marketing strategy for council fostering service",
    "employer": "Liverpool City Council",
    "date": "2015",
    "content": "I was engaged by Liverpool City Council’s fostering team to help resolve a crisis in local foster care provision due in large part to competition from more expensive Independent agencies targeting foster carers on social media and search. Working closely with the fostering team we convinced senior council leaders to fund a one-off proof of concept digital marketing push aligned with a relaunched and rebranded council fostering web offering.",
    "img": "mba-fostering.jpg"
  },
  {
    "title": "Corporate intranet redesign",
    "employer": "Liverpool City Council",
    "date": "2014",
    "content": "Liverpool City Council employs over 7,500 staff over 50+ sites. The corporate intranet is a massively important tool for internal communications and self-serve transactions for council staff. My team undertook an extensive consultation exercise to establish the key tasks and deliverables of the site. Extensive qualitative and quantitative research was performed including staff surveys, Top Task analysis, treejacking of the IA and a new focus around staff location rather than organisational grouping.",
    "img": "Screen-Shot-2018-05-09-at-21.25.57.png"
  },
  {
    "title": "Local government iconset",
    "employer": "Liverpool City Council",
    "date": "2011",
    "content": "Originally produced for Liverpool.gov.uk in 2011, my open source local govt specific Icon set has found its way across the internet and can be seen on local government sites across the world",
    "img": "iconset.png"
  },
  {
    "title": "White label customer support application",
    "employer": "Dayinsure",
    "date": "2017",
    "content": "Dayinsure offer branded versions of their product to industry partners, so when it came time to redesign their call-centre support application, thought needed to be given to rebranding for white-label design. I performed user research with customer support teams before working up a fully-functional HTML/CSS/JS mockup which is being used to code the new application",
    "img": "support-web.png"
  },
  {
    "title": "A pattern library for pattern libraries",
    "employer": "cloudThing",
    "date": "2021",
    "content": "cloudThing (now Kerv digital) wanted an accelerator to speed development of D365 back-ended portals built in React. Storybook was identified as the ideal delivery platform while it was acknowledged that the product might need to accept multiple react frameworks - &quot;teleportal&quot; was developed as a wrapper for any react framework (material-ui, gov-uk-react etc) closely coupled to a set of in-house APIs for connecting to Microsoft Dataverse. Teleportal is currently being used in development of AA accessible applications for UK government and 3rd sector organisations",
    "img": "teleportal.jpg"
  },
  {
    "title": "Design system & pattern library",
    "employer": "Blue Prism",
    "date": "2020",
    "content": "In order to take Blue Prism's class leading enterprise  RPA software from the Windows desktop to the cloud we created the Hyperspace design system to facilitate Blue Prism's roadmap. A full featured design system and component / pattern library designed from scratch using Sketch and Figma, prototyped in Framer and built in React using the Storybook platform. It is packaged as a lerna monorepo. I was responsible for aspects of the whole system: from design, through documentation, code, testing, packaging, CI and deployment. V1 of Hyperspace was released in August 2020.",
    "img": "bp-hyperspace.jpg"
  },
  {
    "title": "Volunteer onboarding system",
    "employer": "cloudThing",
    "data": "2021",
    "content": "These charities, between them the UK's largest volunteer organisations, had a joint project to create a new onboarding system for volunteers. I ideated the system in 2 weeks from provided user research. I am proud to say my proof of concept has been adopted, largely unchanged, and the system is due to be implemented in 2022",
    "img": "welcome.png"
  },
  {
    "title": "GOV.UK Alpha Discovery",
    "employer": "cloudThing",
    "date": "2022",
    "content": "This government department required a digital portal to manage complex licensing and permits from simple personal licences for individuals up to massively complex licences for multiple installations with national security implications. Stepping in last minute to cover for one of cloudThing's directors I produced the full Discovery piece (scheduled to run for 3 months) from scratch to get the project to GOV.UK alpha in 3 weeks, rescuing a key strategic partnership.",
    "img": "ReSP.jpg"
  },
  {
    "title": "Continual improvement programme",
    "employer": "Liverpool City Council",
    "date": "2015",
    "content": "Council websites typically get updated in huge “one-hit” projects every 5 years or so in-between which content & quality tends to deteriorate. I implemented a 2 year rolling improvement programme which ensured every section of Liverpool.gov.uk was revisited regularly, with content audits, user feedback and remote testing leading to in-programme mini-projects as well as generating larger projects for the development team. Integrated with the engagement strategy this also allowed us to start doing “digital transformation by the back door”",
    "img": "lccdesktop.jpeg"
  }
]
